//
//  PromptConstants.swift
//  yummy
//
//  Created by steve on 2025/7/1.
//

import Foundation

/// 提示词常量
struct PromptConstants {
    
    static let systemPrompt = "你是一个乐于解答各种问题的助手，你的任务是为用户提供专业、准确、有见地的建议。 "
    /// 用于与用户输入的 prompt 拼接的常量字符串
    static let userPrompt = """
    以上美食文案是一道美食制作过程文案内容，我要求：
    1、分析出这道美食的名字
    2、整理出所需主要食材及用量，不要遗漏做菜过程中所用到的
    3、对主要食材标注分类，确保分类是合理的（奶制品、大豆坚果、畜禽肉类、水产类、蛋类、蔬菜类、水果类、谷薯杂豆类、水等等）
    4、整理出所需香辛料/调味料及用量
    5、整理出这道美食所需要的酱料/蘸料及用量，通常会包含多个调味品组成，若没有具体讲到，则为 "sauce": []
    6、整理出所需厨具,不包括灶具
    7、根据文案字面意思，整理出正式做菜前的备菜内容，以及备菜所需要达到的效果
    8、整理出这道菜制作过程，每一步要采用原文内容，不要省略，用数字标记制作顺序（备菜的内容不用再重复）
    9、根据文案内容，整理出完整制作过程中的小提示，这些提示可能会在制作前、中、后，不要遗留
    10、给出最适合这道美食的 3 个标签，其中第一个必须是品类
    11、最后将以上整理内容用 json 格式输出，json 中 value 值的内容翻译成中文，不要遗漏key键，如果为空则值用[]表示，使用蛇形命名法

    参考以下 json 格式
    {
      "name": "老母鸡汤",
      "ingredients": {
        "main-ingredients": [
          {
            "name": "老母鸡",
            "quantity": "1只",
            "category": "畜禽肉类"
          },
          {
            "name": "甜玉米",
            "quantity": "1根",
            "category": "谷薯杂豆类"
          },
          {
            "name": "胡萝卜",
            "quantity": "1根",
            "category": "蔬菜类"
          }
        ],
        "spices-seasonings": [
          {
            "name": "生姜",
            "quantity": "几片"
          },
          {
            "name": "大葱",
            "quantity": "几段"
          }
        ],
        "sauce": [
          {
            "name": "老抽",
            "quantity": "少许"
          },
          {
            "name": "蚝油",
            "quantity": "适量"
          },
          {
            "name": "鸡精",
            "quantity": "适量"
          },
          {
            "name": "白糖",
            "quantity": "一勺"
          },
          {
            "name": "淀粉",
            "quantity": "一大勺"
          },
          {
            "name": "清水",
            "quantity": "少许"
          }
        ]
      },
     "tools": [
            {
              "name": "案板"
            },
            {
              "name": "刀"
            },
            {
              "name": "锅"
            },
            {
              "name": "砂锅"
            }
          ],
      "preparation": [
        {
          "step": "鸡的处理",
          "details": "剪掉鸡的饺子，切掉鸡的屁股，去掉鸡脖子的皮，抠干净腔内残余的内脏，把鸡剁成块，用清水清洗干净"
        },
        {
          "step": "焯水",
          "details": "用冷水下锅，加入几片生姜和几段大葱，煮沸后打去浮沫，煮3分钟，捞出鸡块，用温水清洗干净"
        },
        {
          "step": "配料准备",
          "details": "准备甜玉米、胡萝卜、干莲子、枸杞、干百合等食材"
        }
      ],
      "steps": [
        {
          "step": "炒鸡块",
          "details": "锅中加油，下入生姜片和大葱段煸炒出香味，加入鸡块翻炒至表面微微焦黄，散发出浓郁的香味"
        },
        {
          "step": "加水炖煮",
          "details": "加入开水，大火煮沸后大火煮5分钟，再转小火煮10分钟，盖上盖子继续炖煮"
        }
      ],
      "tips": [
        "老母鸡不需要焯水，但如果是冷冻鸡或圈养鸡，建议焯水去腥",
        "焯水时不要使用料酒，可以选择优质的黄酒或者什么都不加"
      ],
      "tags": [
        "汤类",
        "滋补",
        "家常菜"
      ]
    """
}
